res/xml_examples/CreateAppointment/CreateAppointmentRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header>
        <!--Блок подписи -->
    </soapenv:Header>
    <soapenv:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-a809c956-b25d-4ac2-9b77-271e15414fa4">
        <CreateAppointmentRequest xmlns="http://www.rt-eu.ru/med/er/v2_0">
            <Session_ID>30849258-b880-11e9-9a96-005056b17475</Session_ID>
            <Slot_Id>adeaf34a-4c4e-4ee8-a089-66b4295ef900</Slot_Id>
        </CreateAppointmentRequest>
    </soapenv:Body>
</soapenv:Envelope>