res/xml_examples/GetMOInfoExtended/GetMOInfoExtendedRequest_Service_Post_One/GetMOInfoExtendedRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header>
        <!-- Блок подписи-->
    </soapenv:Header>
    <soapenv:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-6759ff3f-d0ea-4d5c-b05c-4a27d4fa2321">
        <GetMOInfoExtendedRequest  xmlns="http://www.rt-eu.ru/med/er/v2_0">
            <Session_ID>1291473c-91cb-11e9-892c-005056b1f66d</Session_ID>
            <Service_Posts>
                <Post>
                    <!--врач-оториноларинголог-->
                    <Post_Id>53</Post_Id>
                </Post>
            </Service_Posts>
        </GetMOInfoExtendedRequest>
    </soapenv:Body>
</soapenv:Envelope>