res/xml_examples/GetMOResourceInfo/GetMOResourceInfoRequest_Inner/GetMOResourceInfoRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header>
        <!-- Блок подписи-->
    </soapenv:Header>
    <soapenv:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-6759ff3f-d0ea-4d5c-b05c-4a27d4fa2321">
        <GetMOResourceInfoRequest xmlns="http://www.rt-eu.ru/med/er/v2_0">
            <Session_ID>413f9340-91be-11e9-ba04-005056b1f66d</Session_ID>
            <Service_Posts>
                <!--На консультацию к специалисту узкой специализации (врач-вертеброневролог - отсутствует в справочнике)-->
                <Post>
                    <!--врач-невролог-->
                    <Post_Id>45</Post_Id>
                    <Add_Info_Post>
                        <Inner_Id>45_098</Inner_Id>
                        <Inner_Name>врач-вертеброневролог</Inner_Name>
                    </Add_Info_Post>
                </Post>
            </Service_Posts>
            <MO_OID_List>
                <MO_OID>1.2.643.5.1.13.13.12.2.59.6056.0.350250</MO_OID>
            </MO_OID_List>
            <Start_Date_Range>2019-06-19</Start_Date_Range>
            <End_Date_Range>2019-07-03</End_Date_Range>
        </GetMOResourceInfoRequest>
    </soapenv:Body>
</soapenv:Envelope>