clients/templates/GetMOInfoExtendedRequest.xml

<?xml version='1.0' encoding='utf-8'?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v2="http://www.rt-eu.ru/med/er/v2_0">
    <soapenv:Header/>
    <soapenv:Body>
        <v2:GetMOInfoExtendedRequest>
            <v2:Session_ID>{session_id}</v2:Session_ID>
            <v2:Service_Posts>
                <v2:Post>
                    <v2:Post_Id>{post_id}</v2:Post_Id>
                </v2:Post>
            </v2:Service_Posts>
        </v2:GetMOInfoExtendedRequest>
    </soapenv:Body>
</soapenv:Envelope>